[
    {
        "category": "техника",
        "title": "Техника «включение эмоций»",
        "text": "Эта техника делается в два шага:\n\t• *Включаем положительный стимул*: представьте себе, что произойдет, если вы достигнете поставленных целей, какие чувства и эмоции вы при этом испытаете, насколько вы будете довольны, счастливы и удовлетворены.\n\t• *Добавляем немного перца*: представьте ситуацию, когда вы НЕ достигаете своих целей. Что будет с вашей жизнью, если вы не станете добиваться того, что задумали? Какой возможности вы себя лишите?\nТакие представления положительного и отрицательного результата очень сильно стимулируют к активности."
    },
    {
        "category": "техника",
        "title": "Техника «кнут и пряник»",
        "text": "Здесь, надеюсь, все понятно и без объяснений: нужно придумать для себя какую-то награду за достижение поставленной цели. Она будет, как морковка для ослика, манить вас туда, куда вам надо.\n\nСвою награду надо продумать заранее.\n\nЧто касается кнута, если мы подвергаемся своей лени, не достигаем поставленных задач, то в этом случае отменяется вся система наград. Можно даже продумать для себя какие-то небольшие штрафы: договоритесь с кем-нибудь, что если не сделаете запланированного, то дадите этому человеку доллар. Мелочь, но все равно почему-то жалко.\n\nКак вариант, можно делать то, что вам нужно, на спор."
    },
    {
        "category": "техника",
        "title": "Техника «деление слонов на котлеты»",
        "text": "Было ли у вас так, что задача уже поставлена, цели определены, а приступить к выполнению задуманного никак не получается? Думаю, что так случалось у каждого: как себя не мотивируй, иногда все равно страшно подступиться к какому-нибудь сложному, энергозатратному  делу.\n\nВ этом случае очень помогает техника «деления слонов на котлеты». Что такое «слон»? Это какая-то большая задача, сложная цель, которую нельзя осуществить единовременно, сразу, в короткий промежуток времени, на это просто нет никаких физических возможностей.\n\nЧтобы этого слона одолеть, нужно разделить его на котлеты и съесть по частям. То есть большую задачу разбиваем на мелкие, очень простые подзадачи.   Начинать нужно с самой легкой и приятной, чтобы получить удовольствие и прилив энергии для дальнейших свершений."
    },
    {
        "category": "техника",
        "title": "Техника «лягушка на завтрак»",
        "text": "По утрам мы поедаем лягушек. Что это значит? Лягушки - это очень неприятные задачи, которые нужно, но сильно не хочется делать. Мы постоянно откладываем их на потом, потому что они сложны и даются нам с огромным трудом.\nПроще всего справиться с этими досадными сложностями с самого утра. Займитесь ими в первую очередь, потому что, когда мы съедаем лягушку на завтрак, она уже не скачет перед нами весь оставшийся день: мы не думаем о том, что нам предстоит что-то неприятное и сложное, поэтому весь день проходит на положительных эмоциях. Ведь мы преодолели себя, побороли какую-то свою слабость, а значит, впереди нас ждут только приятные вещи."
    },
    {
        "category": "техника",
        "title": "Техника «стоп сигнал»",
        "text": "У нас часто находятся какие-то оправдания для того, чтобы не делать то, что запланировано, и постоянно откладывать всё на потом. Хотите знать, как с этим бороться?\n\nИспользуйте технику «стоп сигнал». *Первая часть* заключается в том, чтобы устанавливать конкретный срок, к которому задача должна быть решена. Причём, время выполнения желательно определять не только для решения вашей задачи в целом, но и для каждой мини-цели, из которых она состоит.\n\nСледите, чтобы сроки, которые вы для себя обозначаете, были адекватны выполняемым задачам и имеющимся способностям.\n\n*Вторая часть* этой техники заключается в том, что мы даем публичное обещание сделать то, что запланировали. Мы говорим о своей цели тому, чьё мнение для нас важно, обещаем, что сделаем что-то конкретное в определенный срок.\n\nТакими людьми могут быть и ваши близкие, коллеги, родственники, друзья, соседи, и читатели на вашем блоге, и подписчики в вашей рассылке. Можно изменить статус в социальных сетях, написав там, что вы хотите достигнуть такой-то цели к такому-то сроку. Вариантов много, выбирайте любой или используйте все сразу."
    },
    {
        "category": "техника",
        "title": "Техника «сокращение выбора»",
        "text": "Нужно удалять из поля зрения неважные дела, чтобы сфокусироваться на основном."
    },
    {
        "category": "техника",
        "title": "Метод «Почему?» (5 Why's)",
        "text": "Задавайте вопрос «Почему я этого хочу?» 5 раз подряд, чтобы докопаться до истинной мотивации и понять глубинную причину своего желания."
    },
    {
        "category": "техника",
        "title": "Техника «2 минуты»",
        "text": "Если лень что-то делать — начните хотя бы на 2 минуты. Часто этого достаточно, чтобы втянуться в процесс."
    },
    {
        "category": "цитата",
        "title": "О действии",
        "text": "«Не ждите идеального момента. Возьмите момент и сделайте его идеальным.»\n– Джуд Лоу"
    },
    {
        "category": "цитата",
        "title": "О действии",
        "text": "«Единственный способ сделать что-то великое – полюбить то, что ты делаешь.»\n– Стив Джобс"
    },
    {
        "category": "цитата",
        "title": "О действии",
        "text": "«Сложнее всего начать действовать. Всё остальное зависит только от упорства.»\n– Амелия Эрхарт"
    },
    {
        "category": "цитата",
        "title": "О страхе",
        "text": "«Страх – это всего лишь иллюзия. Он существует только в твоей голове.»\n– Уилл Смит"
    },
    {
        "category": "цитата",
        "title": "О страхе",
        "text": "«Если что-то не пугает тебя хотя бы немного, значит, это недостаточно важно.»\n– Ричард Брэнсон"
    },
    {
        "category": "цитата",
        "title": "О неудачах",
        "text": "«Неудача – это просто возможность начать снова, но уже более мудро.»\n– Генри Форд"
    },
    {
        "category": "цитата",
        "title": "О неудачах",
        "text": "«Падение – это не провал. Провал – это когда ты остаёшься на земле.»\n– Майкл Джордан"
    },
    {
        "category": "цитата",
        "title": "О дисциплине",
        "text": "«Мотивация – это то, с чего ты начинаешь. Привычка – это то, что держит тебя в движении.»\n– Джим Рон"
    },
    {
        "category": "цитата",
        "title": "О дисциплине",
        "text": "«Будущее создаётся сегодня, а не завтра.»\n– Пауло Коэльо"
    },
    {
        "category": "история",
        "title": "История о Томасе Эдисоне",
        "text": "Эдисон провел более 10 000 неудачных экспериментов, прежде чем изобрел лампочку. Когда его спросили, как он не сдался, он ответил: «Я не потерпел неудачу. Я просто нашел 10 000 способов, которые не работают»."
    },
    {
        "category": "история",
        "title": "История о Джоане Роулинг",
        "text": "Перед тем как стать автором «Гарри Поттера», Роулинг была безработной матерью-одиночкой, живущей на пособие. 12 издательств отвергли ее рукопись. Но она верила в свою историю – и в итоге стала одной из самых успешных писательниц в мире."
    },
    {
        "category": "статья",
        "title": "Как перестать откладывать дела на потом",
        "text": "https://www.thevoicemag.ru/psychology/career/kak-perestat-otkladyvat-dela-na-potom/"
    },
    {
        "category": "статья",
        "title": "Мне всё лень, что делать?",
        "text": "https://psychologyjournal.ru/public/mne-vsye-len-chto-delat/"
    },
    {
        "category": "статья",
        "title": "Где искать себя?",
        "text": "https://psychologyjournal.ru/public/gde-iskat-sebya/"
    },
    {
        "category": "статья",
        "title": "Псевдоцели",
        "text": "https://psychologyjournal.ru/public/psevdotseli/"
    }
]